InformationRegisters/Renault_BP_РезультатыКампаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_BP_РезультатыКампаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_БонусныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Выплата</Name>
					<Comment>название тэга для вставки в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_BP_ШаблоныДокументовРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_BP_ШаблоныДокументовРезультатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_БонусныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_BP_РезультатыКампаний/Ext/ManagerModule.bsl
Процедура ЗагрузитьРезультаты(Кампания, ДанныеФайла) Экспорт
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДанныеФайла.Записать(ИмяФайла);
	Таблица = ПрочитатьЕксель(ИмяФайла);

	НаборЗаписей = РегистрыСведений.Renault_BP_РезультатыКампаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кампания.Установить(Кампания);
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.Renault_BP_РезультатыКампаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кампания.Установить(Кампания);
	
	Для Каждого СтрТаблицы из Таблица Цикл
		Для Счетчик = 1 по 50 Цикл
			Попытка
				Запись = НаборЗаписей.Добавить();
				Запись.Кампания = Кампания;
				Запись.Дилер = СтрТаблицы.BIR;
				Запись.Выплата = "SUM" + Строка(Счетчик);
				Запись.Сумма = СтрТаблицы["SUM" + Строка(Счетчик)];
	            Запись.Описание = СтрТаблицы["NAME" + Строка(Счетчик)];

			Исключение
				Прервать;
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Функция ПрочитатьЕксель (ФайлEXCEL)
	
	СonnectionString = Новый Структура;
	// Основные.
	СonnectionString.Вставить("Jet_OLEDB_4_0_Excel_8_0"			, "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 8.0;HDR=YES;IMEX=1;""");		// XLS: Для книг Microsoft Excel 8.0 (97).
	СonnectionString.Вставить("Excel_Driver_XLS"				, "Driver={Microsoft Excel Driver (*.xls)};Dbq= " 	+ СокрЛП(ФайлEXCEL) + ";ReadOnly=1;");												// XLS: Для книг ранее Microsoft Excel 9.0 (2007).
	СonnectionString.Вставить("ACE_OLEDB_12_0_Excel_12_0_XML"	, "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 12.0 XML;HDR=YES;IMEX=1;""");	// XLSX: Для книг Microsoft Excel 9.0 (2007) и выше.
	СonnectionString.Вставить("Excel_Driver_XLSX"				, "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};Dbq=" + СокрЛП(ФайлEXCEL) + ";ReadOnly=1;");							// XLSX: Для книг Microsoft Excel 9.0 (2007) и выше.
	// Дополнительные.
	СonnectionString.Вставить("Jet_OLEDB_4_0_Excel_9_0"			, "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 9.0;HDR=YES;IMEX=1;""");		// XLS: Для книг Microsoft Excel 9.0 (2000).
	СonnectionString.Вставить("ACE_OLEDB_12_0_Excel_8_0"		, "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 8.0;HDR=YES;IMEX=1;""");		// XLSX: Для книг Microsoft Excel 9.0 (2007) и выше.
	СonnectionString.Вставить("ACE_OLEDB_12_0_Excel_12_0"		, "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 12.0;HDR=YES;IMEX=1;""");		// XLSX: Для книг Microsoft Excel 9.0 (2007) и выше.
	
	ADODBConnection = Неопределено;
	Для Каждого СтрокаСоединения ИЗ СonnectionString Цикл
		Попытка
			ADODBConnection = Новый COMОбъект("ADODB.Connection");	// Инициализация ADODB.
			ADODBConnection.Open(СтрокаСоединения.Значение);		// Открытие соединения.
			// Импирически определенный параметр для правильного определения количества строк листа.
			ADODBConnection.CursorLocation 	= 3;					// По-умолчанию 2.
			Прервать;
		Исключение
			//Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = '" + 
			//КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) 
			//+ "'"));
			ADODBConnection = Неопределено;
		КонецПопытки;
	КонецЦикла;
	
	Если ADODBConnection = Неопределено Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	СписокЛистов = Новый СписокЗначений;
	ADOXCatalog = Новый COMОбъект ("ADOX.Catalog");
	ADOXCatalog.ActiveConnection = ADODBConnection;
	
	Для Каждого objList ИЗ ADOXCatalog.Tables Цикл
		ИмяЛиста = objList.Name;
		Если ИмяЛиста = "Excel_BuiltIn_Database" ИЛИ ИмяЛиста = "База_данных" Тогда	// Исключаем лист "по-умолчанию" и лист, преобразованного файла DBF.
			Продолжить;
		КонецЕсли;
		ПроверкаИмениЛистаНаСодержаниеНедопустимыхСимволов(ИмяЛиста);
		СписокЛистов.Добавить(ИмяЛиста);	// Добавляем в список имя листа "как есть".
	КонецЦикла;  

	Лист = СписокЛистов[0];
	
	ADODBRecordset = ПолучитьADODBRecordset(ADODBConnection,Лист.Значение);
	
	Таблица = Новый ТаблицаЗначений;
		
	Если ADODBRecordset <> Неопределено и ADODBRecordset.RecordCount > 0 Тогда
		КолвоКолонокExcel = ADODBRecordset.Fields.Count;
		Таблица.Колонки.Добавить("BIR");
		Для Счетчик = 1 по ADODBRecordset.Fields.count()-1 Цикл
			Таблица.Колонки.Добавить("SUM" + Строка(Счетчик));
			Таблица.Колонки.Добавить("NAME" + Строка(Счетчик));
		КонецЦикла;
		СтруктураНазваний = Новый Соответствие;
		Пока ADODBRecordset.EOF() = 0 Цикл
			Если ADODBRecordset.Fields.Item(0).Value = "BIR" Тогда
				Для Счетчик = 1 по ADODBRecordset.Fields.count() - 1 Цикл 
					СтруктураНазваний.Вставить(Счетчик, Формат(ADODBRecordset.Fields.Item(Счетчик).Name,"ЧГ=0")); 
				КонецЦикла;
			ИначеЕсли ADODBRecordset.Fields.Item(0).Value <> "" Тогда
				СтрокаТЗ = Таблица.Добавить();
				СтрокаТЗ.BIR = Формат(ADODBRecordset.Fields.Item(0).Value,"ЧГ=0");
				Для Счетчик = 1 по ADODBRecordset.Fields.count() - 1 Цикл
					СтрокаТЗ["SUM" + Строка(Счетчик)] = Формат(ADODBRecordset.Fields.Item(Счетчик).Value,"ЧГ=0");
					СтрокаТЗ["NAME" + Строка(Счетчик)] = СтруктураНазваний.Получить(Счетчик);
				КонецЦикла;
			КонецЕсли;
			ADODBRecordset.MoveNext();
		КонецЦикла;
		ADODBRecordset.Close();
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция ПроверкаИмениЛистаНаСодержаниеНедопустимыхСимволов(ФайлИмяЛиста, ПоказатьПредупреждение = Истина)
	
	// Недопустимые символы в имени листа EXCEL: \ : / ? * [ ].
	
	// Недопустимые "обязательные".
	Если Найти(ФайлИмяЛиста, "/") > 0 Тогда
		Если ПоказатьПредупреждение Тогда
			//Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""слеш"": ""/"". Замените на сивол другой или удалите.");
		КонецЕсли;
		Возврат Ложь;
	ИначеЕсли Найти(ФайлИмяЛиста, "\") > 0 Тогда
		Если ПоказатьПредупреждение Тогда
			//Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""обратный слеш"": ""\"". Замените на сивол другой или удалите.");
		КонецЕсли;
		Возврат Ложь;
	ИначеЕсли Найти(ФайлИмяЛиста, ":") > 0 Тогда
		Если ПоказатьПредупреждение Тогда
			//Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""двоеточие"": "":"". Замените на сивол другой или удалите.");
		КонецЕсли;
		Возврат Ложь;
	ИначеЕсли Найти(ФайлИмяЛиста, "?") > 0 Тогда
		Если ПоказатьПредупреждение Тогда
			//Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""вопросительный знак"": ""?"". Замените на сивол другой или удалите.");
		КонецЕсли;
		Возврат Ложь;
	ИначеЕсли Найти(ФайлИмяЛиста, "*") > 0 Тогда
		Если ПоказатьПредупреждение Тогда
			//Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""звездочка"": ""*"". Замените на сивол другой или удалите.");
		КонецЕсли;
		Возврат Ложь;
	ИначеЕсли Найти(ФайлИмяЛиста, "[") > 0 Тогда
		Если ПоказатьПредупреждение Тогда
			//Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""левая квадратная скобка"": ""["". Замените на сивол другой или удалите.");
		КонецЕсли;
		Возврат Ложь;
	ИначеЕсли Найти(ФайлИмяЛиста, "]") > 0 Тогда
		Если ПоказатьПредупреждение Тогда
			//Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""правая квадратная скобка"": ""]"". Замените на сивол другой или удалите.");
		КонецЕсли;
		Возврат Ложь;
	ИначеЕсли Найти(ФайлИмяЛиста, "'") > 0 Тогда
		ФайлИмяЛиста = СтрЗаменить(ФайлИмяЛиста,"'","");
		Если ПоказатьПредупреждение Тогда
			//Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""одинарную кавычку"" : ""'"". Замените на сивол другой или удалите.");
		КонецЕсли;
		Возврат Ложь;
		
	// Нерекомендуемые "для обработки".
		
	//ИначеЕсли Найти(ФайлИмяЛиста, " ") > 0 Тогда
	//	Если ПоказатьПредупреждение Тогда
	//		Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ пробел(ы). Удалите пробел(ы)");
	//	КонецЕсли;
	//	Возврат Ложь;
	//ИначеЕсли Найти(ФайлИмяЛиста, """") > 0 Тогда
	//	Если ПоказатьПредупреждение Тогда
	//		Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""двойную кавычку"". Замените на сивол другой или удалите.");
	//	КонецЕсли;
	//	Возврат Ложь;
	//ИначеЕсли Найти(ФайлИмяЛиста, "'") > 0 ИЛИ Найти(ФайлИмяЛиста, "!") > 0 ИЛИ Найти(ФайлИмяЛиста, "-") > 0 Тогда
	//	Если ПоказатьПредупреждение Тогда
	//		Сообщить("Имя листа:" + ФайлИмяЛиста + " содержит недопустимый символ ""одинарную кавычку"" или символ ""восклицательный знак"": ""!"" или символ ""дефис"": ""-"". Замените на сивол другой или удалите.");
	//	КонецЕсли;
	//	Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьADODBRecordset(ADODBConnection, ИмяЛиста)
	Перем ТекстЗапроса, ADODBRecordset, ИмяЛистаТМП;
	
	ИмяЛистаТМП  = ?(Прав(ИмяЛиста, 1) = "$", ИмяЛиста, ИмяЛиста + "$");
	ТекстЗапроса = "SELECT * FROM [" + ИмяЛистаТМП + "]";
	
	// Создание Recordset. Дочерний объект ADODBConnection. Набор записей по запросу.
	Попытка
		ADODBRecordset = Новый COMОбъект("ADODB.Recordset");
		ADODBRecordset.Open(ТекстЗапроса, ADODBConnection);
		
		// Импирически определенные параметры для правильного определения количества строк листа.
		ADODBRecordset.AbsolutePage 	= 1;
		ADODBRecordset.AbsolutePosition = 1;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ADODBRecordset;
	
КонецФункции

Процедура ОчиститьРезультаты(Кампания) Экспорт
	
	НаборЗаписей = РегистрыСведений.Renault_BP_РезультатыКампаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кампания.Установить(Кампания);
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура СформироватьФайлы(Кампания, ИмяПапки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	BP_РезультатыКампаний.Дилер КАК Дилер
		|ИЗ
		|	РегистрСведений.Renault_BP_РезультатыКампаний КАК BP_РезультатыКампаний
		|ГДЕ
		|	BP_РезультатыКампаний.Кампания = &Кампания";
	Запрос.УстановитьПараметр("Кампания", Кампания);
	ВыборкаДилеры = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДилеры.Следующий() Цикл
		Дилер = ВыборкаДилеры.Дилер;
		СтруктураДанных = Новый Структура;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	BP_РезультатыКампаний.Выплата,
			|	BP_РезультатыКампаний.Сумма
			|ИЗ
			|	РегистрСведений.Renault_BP_РезультатыКампаний КАК BP_РезультатыКампаний
			|ГДЕ
			|	BP_РезультатыКампаний.Кампания = &Кампания
			|	И BP_РезультатыКампаний.Дилер = &Дилер";
		Запрос.УстановитьПараметр("Кампания", Кампания);
		Запрос.УстановитьПараметр("Дилер", Дилер);
		ВыборкаДанные = Запрос.Выполнить().Выбрать();
		Пока ВыборкаДанные.Следующий() Цикл
			СтруктураДанных.Вставить(ВыборкаДанные.Выплата, ВыборкаДанные.Сумма);
			СтруктураДанных.Вставить(нрег(ВыборкаДанные.Выплата), ВыборкаДанные.Сумма);
		КонецЦикла;
		
		ДанныеФайла = РегистрыСведений.Renault_BP_ШаблоныДокументовРезультатов.ПолучитьШаблон(Кампания);
		Если ДанныеФайла = Неопределено Тогда
			ВызватьИсключение "Не указан шаблон для формирования результатов";
		КонецЕсли;
		
		ДанныеЗаполненногоФайла = 
			Renault_АвтозаполнениеШаблоновФайловКлиентСервер.ЗаполнитьФайлMSWordПоДвоичнымДанным(
				"DOCX", СтруктураДанных, ДанныеФайла);
				
		ДанныеЗаполненногоФайла.Записать(ИмяПапки+ "/" + Дилер + ".docx");
		
	КонецЦикла;
	
КонецПроцедуры
